Repository: lou320/ScammerDB
Catalog: locale/*/LC_MESSAGES/django.po
Languages: my

source: Phone Number
my: ဖုန်းနံပါတ်

source: Scammer Phone Number
my: လူလိမ်၏ ဖုန်းနံပါတ်

source: Description
my: အကြောင်းအရာအသေးစိတ်

source: Name
my: အမည်

source: Names
my: အမည်များ

source: Phone Numbers
my: ဖုန်းနံပါတ်များ

source: Tags
my: အကြောင်းအရာ အတိုကောက်

source: Click here to see the details of scammer and related cases.
my: လူလိမ်၏အချက်အလက်များနှင့် ဆက်စပ်သောလိမ်လည်မှုများကိုကြည့်ရန် နှိပ်ပါ။

source: Payment Accounts
my: လူလိမ်၏ ငွေလက်ခံသည့်အကောင့်မျာ

source: Email
my: အီးမေးလ်

source: Website
my: ဝက်ဘ်ဆိုဒ်

source: Image
my: ဓာတ်ပုံ

source: Payment Account: Number & Name
my: လူလိမ်၏ ငွေလက်ခံသည့်အကောင့်

source: Phone
my: ဖုန်းနံပါတ်

source: Account
my: လူလိမ်၏ ငွေလက်ခံသည့်အကောင့်

source: Add Scammer Details
my: လူလိမ်၏အချက်အလက်များကိုထည့်သွင်းပါ

source: Add tags
my: အကြောင်းအရာ အတိုကောက်

source: Save Scammer
my: ထည့်သွင်းရန်

source: Cancel
my: မလုပ်တော့ပါ

source: Payment Account
my: လူလိမ်၏ ငွေလက်ခံသည့်အကောင့်

source: Scammer Database
my: လူလိမ်များ၏အချက်အလက်များ

source: Add Scammer
my: လူလိမ်အသစ် ထည့်သွင်းရန်

source: Language
my: ဘာသာစကား

source: Register
my: အကောင့်ဖွင့်မည်

source: All
my: အားလုံး

source: Tag
my: အကြောင်းအရာ

source: Search
my: ရှာဖွေရန်

source: Your Privacy is Protected
my: သင့်လုံခြုံမှုအတွက် အာမခံပါသည်။

source: When you add a scammer, your submission is fully anonymous. We do not collect or store any personal information from your device or browser. Our goal is to protect the community, and that includes protecting your privacy.
my: ယခု website ကို အသုံးပြုပြီး လူလိမ်များ၏ အချက်အလက်များကို website ပေါ်တင်ရာတွင်၊ အသုံးပြုသူ၏ အချက်အလက်များကို ကျွန်တော်တို့ ScammerDB မှသိမ်းစည်းထားချင်းမရှိသည့်အတွက်ကြောင့် စိတ်ချလုံခြုံစွာ အသုံးပြုနိုင်ပါသည်။

source: All rights reserved.
my: မူပိုင်ခွင့်ရှိသည်။

source: Search by
my: ရှာဖွေရန်

source: Don't have an account? Register here
my: အကောင့်မရှိပါက အကောင့်ဖွင့်ရန်နှိပ်ပါ။

source: Back to List
my: ပင်မစာမျက်နှာ သို့

source: Related Cases
my: အခြား ဆက်စပ်သောလိမ်လည်မှုများ

source: Install the app on your device to easily access it anytime.
my: Install ပြုလုပ်ပြီး လွယ်ကူစွာအသုံးပြုလိုက်ပါ။

source: Tap on
my: ဖော်ပြပါပုံသဏ္ဌာန်နှင့်ခလုတ်အား နှိပ်ပါ။

source: Select 'Add to Home Screen'
my: ‘Add to Home Screen’ ကိုနှိပ်ပါ။

source: Not Now
my: မလုပ်သေးပါ

source: To contact ScammerDB Admin From Facebook and Messenger
my: ScammerDB admin အား Facebook နှင့် Messenger မှ ဆက်သွယ်ရန်

source: Or to contact from Telegram
my: သို့မဟုတ် Telegram မှဆက်သွယ်ရန်

source: Contact Us
my: ဆက်သွယ်ရန်

source: Click the + icon at lower corner of the screen to add scammer details.
my: ညာဘက်အောက်ထောင့်မှ + ပုံလေးကိုနှိပ်ပြီး လူလိမ်၏ အချက်အလက်များကိုထည့်သွင်းနိုင်ပါသည်။
